# StdPostedWarning Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StdPostedWarning Properties
StdPostedWarning Class See Also
---
The StdPostedWarning type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
StdPostedWarning Class
Autodesk.Revit.DB Namespace